{
  "food_categories": [
    {
      "id": "a123asdsad",
      "name": "Pizzas",
      "image": "https://images.vexels.com/media/users/3/263340/isolated/preview/92d75abef1c7523630339a2793eba5eb-fatia-de-traa-o-de-cor-de-pizza.png",
      "menu": [
        {
          "id": "b213213213",
          "title": "Brazilian",
          "pizzas": [
            {
              "id": "c321313123",
              "name": "Napolitana",
              "description": "The very traditional Neapolitan pizza has become popular in Brazilian cities. It is a natural fermentation thin crust pizza that, after going through a wood-fired oven with a dome, is crispy and tasty. The Neapolitan is individual, is about 35 cm and filled to measure.",
              "image": "http://imagenspng.com/wp-content/uploads/pizza-napolitana-png-Download-gratis.png",
              "qtyStars": 4,
              "value": 30,
              "location": "Mirazur",
              "preparation_time": "42 min",
              "distance_shop": "2.3 Km"
            },
            {
              "id": "dsaff21321321",
              "name": "Calabresa",
              "description": "The pepperoni pizza is by far the favorite of Brazilians, with 30% preference. Served with or without tomato sauce — as is popular in São Paulo — pepperoni became a national favorite. With an intense flavor, the combination of pepperoni, sauce and onion is perfect!",
              "image": "https://imagenspng.com/wp-content/uploads/pizza-calabresa-png-Imagem-clipart-gratis.png",
              "qtyStars": 5,
              "value": 29,
              "location": "Noma",
              "preparation_time": "42 min",
              "distance_shop": "7.3 Km"
            },
            {
              "id": "e213321dffdsaf",
              "name": "Portuguesa",
              "description": "Portuguese pizza has many ingredients: cheese, ham, eggs, peas, onions and olives. However, the flavors combine very well, in addition to satisfying hunger, representing 21% of orders in the capitals.",
              "image": "https://i0.wp.com/www.multarte.com.br/wp-content/uploads/2019/03/png-pizza9.png?resize=696%2C696&ssl=1",
              "qtyStars": 4,
              "value": 33,
              "location": "Etxebarri",
              "preparation_time": "36 min",
              "distance_shop": "12.3 Km"
            },
            {
              "id": "fdf21321321",
              "name": "Frango com catupiry",
              "description": "The chicken pizza with catupiry is certainly not among the original flavors, but it has awakened the passion of Brazilians over time. Catupiry and chicken enhance each other's qualities and combine with other ingredients such as corn and onion.",
              "image": "https://w7.pngwing.com/pngs/774/872/png-transparent-paradise-pizzaria-ribeirao-preto-manakish-bacon-catupiry-pizza-baked-goods-food-recipe-thumbnail.png",
              "qtyStars": 5,
              "value": 31,
              "location": "Gaggan",
              "preparation_time": "36 min",
              "distance_shop": "28 Km"
            },
            {
              "id": "gsdf23132131",
              "name": "Mussarela",
              "description": "If the margherita already shows that it is possible to make a lot with few ingredients, the mozzarella pizza is the proof. Sauce, cheese, oregano and perhaps an olive all come together in an excellent meal.",
              "image": "https://img2.gratispng.com/20180428/owe/kisspng-pizza-mozzarella-bacon-cheese-delivery-5ae46721cb5644.6284924715249180498329.jpg",
              "qtyStars": 3,
              "value": 28,
              "location": "Geranium",
              "preparation_time": "34 min",
              "distance_shop": "14.7 Km"
            }
          ]
        },
        {
          "id": "h321321321asdas",
          "title": "Estrangeiras",
          "pizzas": [
            {
              "id": "i13dsadasdsadsa",
              "name": "Colorado Mountain Pie",
              "description": "More edge, more cheese and more stuffing. Also known as Colorado-style, this pizza stands out for its size. Legend has it that it was invented by Beau Jo's Pizzeria, which is located in the city of Idaho Springs, Colorado. The pizza presentation was successful among the city's residents and the business expanded to other regions of the state.",
              "image": "https://cdn.tasteatlas.com/images/dishes/6665987d9c28429d997b1da0e47a670b.jpg",
              "qtyStars": 5,
              "value": 42,
              "location": "Central",
              "preparation_time": "29 min",
              "distance_shop": "42.9 Km"
            },
            {
              "id": "jalds3213sad",
              "name": "Deep-dish Pizza",
              "description": "A symbol of Italian gastronomy, pizza has crossed borders and has definitely conquered its space in the most diverse corners of the world. This is so true that today, in Brazil, there is even Pizza Day: on July 10th, everyone has the perfect excuse to ask for yours. And just as the Mediterranean recipe was adapted in Brazil (do you know any other place where you can eat stroganoff pizza or hot dog?), in the United States, the joke was also taken seriously. At Warren, we believe that the best way to invest is by objectives, that is, each dream you have deserves a specific portfolio to make it come true. And who doesn't dream of traveling? That's why we've gathered the most classic American pizzas for you to discover and put on your to-do list when the long-awaited time comes. Come on? READ ALSO | Investing to travel? Check out 7 movies and series to watch while your money makes Colorado Mountain Pie: lots of cheese and a respectable edge More edge, more cheese and more filling. Also known as Colorado-style, this pizza stands out for its size. Legend has it that it was invented by Beau Jo's Pizzeria, which is located in the city of Idaho Springs, Colorado. The pizza presentation was successful among the city's residents and the business expanded to other regions of the state. A traditional pepperoni pizza from Beau Jo's Pizzeria It was then that skiers discovered one of the restaurants near the Rockies, and Colorado Mountain Pie's fame spread. Its biggest difference is the edge, which is large and braided to give more stability when eating the huge pieces with your hands. In pasta, honey replaces sugar — even, after a meal, the edge is consumed as a dessert, accompanied by some sweet sauce. Traditionally, Colorado Mountain Pie is sold whole or by the slice, and local restaurants offer a salad buffet as an accompaniment.",
              "image": "https://www.pngitem.com/pimgs/m/507-5077809_pizza-deep-dish-puget-sound-deepdishpizza-sunka-cotto.png",
              "qtyStars": 4,
              "value": 37,
              "location": "Mugaritz",
              "preparation_time": "45 min",
              "distance_shop": "5.2 Km"
            },
            {
              "id": "klsfoiio31231",
              "name": "Detroit-style Pizza",
              "description": "A descendant of the Sicilian square pizza, Detroit-style pizza was created in the mid-1950s in Detroit, Michigan. The square shape, the crispy dough and the cheese that overflows from the slices are its trademarks. The invention of Detroit-style pizza is attributed to Gus Guerra, at the time the owner of a local restaurant called Buddy’s Rendezvous, now also a Detroit tourist spot. He needed a new item for his menu and, with the help of his wife, Anna, he ended up creating a real hit. The history of pizza is deeply connected with the history of the city itself. On the Buddy’s Rendezvous website, you can read the following sentence: “What makes a pizza Detroit-style? The same things that made Detroit: a little ingenuity, a stubborn spirit and a lot of heart.” The main ingredient in making a good Detroit-style is not something you eat, but the pot. Made of dense steel, it is responsible for the square shape, the crispness and the caramelized cheese in the corners of the pizza.",
              "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRX3GKUewebKnQfZjJDMv9n8AdpwuMw2i2l_HoAay5g6pX4emFlxoO0-FCqugCflqDG3Ns&usqp=CAU",
              "qtyStars": 5,
              "value": 39,
              "location": "Arpège",
              "preparation_time": "40 min",
              "distance_shop": "13.1 Km"
            },
            {
              "id": "lsadfnaio1321321",
              "name": "New York-style Pizza",
              "description": "It's almost impossible to think about New York and not see the delicious and thin slices of pizza sold there. The New York-style pizza was also inspired by recipes from Naples, but it's bigger and less crunchy. That's why New Yorkers often fold the pizza and eat the pieces with their hands. In fact, this culture of eating with your hands is so strong that eating with cutlery is practically a gaffe. In 2014, then-Mayor of New York, Bill de Blasio, found himself in The New York Times after being caught using a knife and fork to eat a pizza. The history of New York-style pizza begins at the very beginning of the 20th century, with the opening of the first pizzeria in the United States, Lombardi’s, in the Little Italy neighborhood of New York. Initially, its owner, Gennaro Lombardi, sold classic Neapolitan pizza. But over the years, it changed, until it arrived at the New York-style pizza we know today. The classic base is tomato sauce and mozzarella cheese, but several other ingredients can be added (pepperoni pizza is unanimous among locals).",
              "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSyFvi5yFD8f-QDYeR2YATDNLPplW1qhLGjf6sC_TZmqVlhIEB24i1DFwAjE_9nKlz9358&usqp=CAU'",
              "qtyStars": 3,
              "value": 35,
              "location": "Disfrutar",
              "preparation_time": "31 min",
              "distance_shop": "3.8 Km"
            },
            {
              "id": "maiodio131312",
              "name": "St. Louis-style Pizza",
              "description": "Born in the American Midwest, in the state of Missouri, she has a thin crust, a crispy edge like a cookie and extra ingredients that go from one end to the other. But the key to an authentic St. Louis-style pizza is Provel cheese, a mixture of cheddar, Swiss and provolone cheeses that results in a super creamy cheese. Some say the Provel was created in St. Louis, but there are controversies. In any case, it is now an inseparable part of the city's gastronomic culture. Unlike most pizzas, St. Louis-style comes cut into small square pieces — and the “experts” say the best way to start is by eating the triangle-shaped pieces from the 4 corners of the pizza. The most popular flavor among its connoisseurs is bacon.",
              "image": "https://img2.gratispng.com/20180428/owe/kisspng-pizza-mozzarella-bacon-cheese-delivery-5ae46721cb5644.6284924715249180498329.jpg",
              "qtyStars": 4,
              "value": 38,
              "location": "Maido",
              "preparation_time": "39 min",
              "distance_shop": "19.4 Km"
            }
          ]
        }
      ]
    },
    {
      "id": "nad3213sadp12321321321",
      "name": "Hamburguer",
      "image": "https://i.pinimg.com/originals/3f/1c/f0/3f1cf0e2c1db8beaca0cffd41c24a826.png",
      "menu": []
    },
    {
      "id": "olasnd1321321",
      "name": "Sushi",
      "image": "https://assets.stickpng.com/images/580b57fcd9996e24bc43c1f9.png",
      "menu": []
    },
    {
      "id": "palk1321321312",
      "name": "Esfirras",
      "image": "https://i.pinimg.com/originals/48/0f/73/480f736ffe3ff2e42c3dba1f1f70d8b1.png",
      "menu": []
    },
    {
      "id": "qsadsadasdas12321",
      "name": "Pratos",
      "image": "http://4.bp.blogspot.com/-8z1N32nGBM0/ULe8uHl_ysI/AAAAAAAACc4/TwuxomeFXvI/s1600/PRATO+FEITO.png",
      "menu": []
    },
    {
      "id": "r213213sdsadsad",
      "name": "Sorvetes",
      "image": "https://static.wixstatic.com/media/6bcbf0_50148f653b4f4b41bcf5c2ee3090135f~mv2.png/v1/fill/w_560,h_466,al_c,q_85,usm_0.66_1.00_0.01,enc_auto/sorvete.png",
      "menu": []
    }
  ],
  "popular_foods": [
    {
      "id": "adsad21321321sadsadsa2132",
      "name": "Moussaka",
      "image": "https://static.wikia.nocookie.net/chefville/images/3/38/Recipe-Moussaka.png/revision/latest/scale-to-width-down/280?cb=20130108091043",
      "location": "Grécia",
      "description": "Moussaka is a typical Mediterranean dish. In Greece, for example, it is extremely popular. Looking at it from afar it is very similar to a lasagna, but its preparation is very different. Moussaka is usually made with a bechamel cheese sauce, lamb and eggplant.",
      "qtyStars": 5,
      "value": 25,
      "preparation_time": "18 min",
      "distance_shop": "23.3 Km"
    },
    {
      "id": "basdsadwe2131312adsa",
      "name": "MASALA DOSA",
      "image": "https://linguini.akamaized.net/starchef2_website/masala_dosa.png",
      "location": "Índia",
      "description": "This typically Indian dish is similar to a pancake, but don't be fooled. The pasta is made from rice and lentils and can have mashed potatoes, fried onions and chutney. If you go to India, you will come across this dish, which is extremely popular in the country.",
      "qtyStars": 4,
      "value": 29,
      "preparation_time": "22 min",
      "distance_shop": "27.3 Km"
    },
    {
      "id": "vasdsadsad21321",
      "name": "ZUCHINI FLOWERS",
      "image": "https://i.pinimg.com/originals/45/13/ee/4513ee0c239d70c553a2f2a561e4ee8a.png",
      "location": "Toscana",
      "description": "Have you ever thought about eating zucchini flowers? I bet not! But if you are passing through Tuscany don't miss the opportunity. There, they are usually stuffed with ricotta and herbs or mozzarella cheese, and then they are dipped and fried in olive oil.",
      "qtyStars": 4,
      "value": 29,
      "preparation_time": "29 min",
      "distance_shop": "45.3 Km"
    }
  ]
}
